<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Cocktail for High Sierra and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.mikaellofgren.pkg.CocktailHighSierra</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.maintain.cocktail.highsierra</string>
		<key>NAME</key>
		<string>CocktailHighSierra</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.CocktailHighSierra</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
            </dict>
        </array>
    </dict>
</plist>
