<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of FontAgent and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.mikaellofgren.munki.FontAgent</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Apps/insidersoftware/%NAME%</string>
            <key>NAME</key>
            <string>FontAgent</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Font management and repair utility.</string>
                <key>category</key>
                <string>Font Management</string>
                <key>developer</key>
                <string>Insider Software Inc.</string>
                <key>display_name</key>
                <string>FontAgent 9</string>
                <key>icon_name</key>
                <string>Fontagent9new.png</string>
                <key>minimum_os_version</key>
                <string>10.11</string>
                <key>blocking_applications</key>
                <array>
                    <string>FontAgent.app</string>
                </array>
                <key>postinstall_script</key>
                <string>#!/bin/bash
PLIST="/Library/Preferences/InsiderSoftware/v9/com.insidersoftware.v9.common.plist"
/usr/bin/defaults write "$PLIST" /Library/Preferences/InsiderSoftware/v9/com.insidersoftware.v9.common cleanCachesType
exit 0</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true></true>
                <key>uninstall_method</key>
                <string>uninstall_script</string>
                <key>uninstall_script</key>
                <string>#!/bin/bash
"/Applications/FontAgent 9/Uninstaller.app/Contents/MacOS/Uninstaller"
exit 0</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.mikaellofgren.download.FontAgent</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
                    <key>purge_destination</key>
                    <true></true>
                    <key>skip_payload</key>
                    <false></false>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
                <key>Processor</key>
                <string>DmgCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/fontagentinstall</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked/fontagentinstall.pkg/Payload</string>
                    <key>purge_destination</key>
                    <true></true>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/fontagentinstall/Applications/FontAgent 9/FontAgent.app/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleShortVersionString</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>bundleid</string>
                        <key>CFBundleName</key>
                        <string>bundlename</string>
                        <key>CFBundleVersion</key>
                        <string>bundleversion</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>overwrite</key>
                    <string>true</string>
                    <key>source</key>
                    <string>%RECIPE_CACHE_DIR%/fontagentinstall/Applications/</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/Applications</string>
                </dict>
                <key>Processor</key>
                <string>FileMover</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Applications/FontAgent 9/FontAgent.app</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/Applications</string>
                        <string>%RECIPE_CACHE_DIR%/unpacked</string>
                        <string>%RECIPE_CACHE_DIR%/fontagentinstall</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>