<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of FontAgent and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.mikaellofgren.munki.FontAgent</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Apps/insidersoftware/%NAME%</string>
		<key>NAME</key>
		<string>FontAgent</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Font management and repair utility.</string>
			<key>category</key>
			<string>Font Management</string>
			<key>developer</key>
			<string>Insider Software Inc.</string>
			<key>display_name</key>
			<string>FontAgent 9</string>
			<key>icon_name</key>
			<string>Fontagent9new.png</string>
			<key>minimum_os_version</key>
			<string>10.11</string>
			<key>postinstall_script</key>
	<string>#!/bin/bash
PLIST="/Library/Preferences/InsiderSoftware/v9/com.insidersoftware.v9.common.plist"
/usr/bin/defaults write "$PLIST" /Library/Preferences/InsiderSoftware/v9/com.insidersoftware.v9.common cleanCachesType
exit 0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/bash
"/Applications/FontAgent 9/Uninstaller.app/Contents/MacOS/Uninstaller"
exit 0</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.FontAgent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
