<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
    <string>Downloads Cocktail El Capitan Edition disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.mikaellofgren.munki.CocktailElCapitan</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CocktailElCapitan</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
			<string>Utilities</string>
            <key>description</key>
            <string>Cocktail is a general purpose utility for OS X that lets you clean, repair and optimize your Mac.</string>
            <key>developer</key>
			<string>Maintain</string>
            <key>display_name</key>
            <string>CocktailElCapitan</string>
            <key>minimum_os_version</key>
            <string>10.11</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.CocktailElCapitan</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
