<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Cocktail Lion Edition disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.mikaellofgren.munki.CocktailLion</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CocktailLion</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps/Cocktail</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
                <string>production</string>
            </array>
            <key>category</key>
			<string>Utilities</string>
            <key>description</key>
            <string>Cocktail is a general purpose utility for OS X that lets you clean, repair and optimize your Mac.</string>
            <key>developer</key>
			<string>Maintain</string>
			<key>display_name</key>
            <string>CocktailLion</string>
            <key>minimum_os_version</key>
            <string>10.7</string>
            <key>maximum_os_version</key>
			<string>10.7.99</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.CocktailLion</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>