<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Cocktail Lion Edition.
</string>
    <key>Identifier</key>
    <string>com.github.mikaellofgren.pkg.CocktailLion</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cocktail</string>
        <key>DOWNLOAD_URL</key>
                <string>http://usa.maintain.se/CocktailLionEdition.dmg</string>
                </dict>
    <key>MinimumVersion</key>
    <string>0.2</string>
    <key>Process</key>
    <array>
        <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                                <key>url</key>
                                <string>%DOWNLOAD_URL%</string>
                        </dict>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                </dict>
        </array>
</dict>
</plist>