<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of FSecure Mac Protection</string>
        <key>Identifier</key>
        <string>com.github.mikaellofgren.download.FSecureMacProtection</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>F-Secure Mac Protection</string>
            <key>DOWNLOAD_URL</key>
            <string>https://download.sp.f-secure.com/PSB/latest/installer/F-Secure_PSB1_Mac_Installer.mpkg</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>F-Secure_PSB1_Mac_Installer.mpkg</string>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: F-Secure Corporation (6KALSAFZJC)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>