<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of FSecureMacProtection and imports into Munki</string>
        <key>Identifier</key>
        <string>com.github.mikaellofgren.munki.FSecureMacProtection</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/fsecure/%NAME%</string>
            <key>NAME</key>
            <string>F-Secure Mac Protection</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Antivirus</string>
                <key>description</key>
                <string>F-Secure Mac Protection</string>
                <key>developer</key>
                <string>F-Secure</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>minimum_os_version</key>
                <string>10.12.0</string>
                <key>unattended_install</key>
                <true></true>
                <key>blocking_applications</key>
                <array></array>
                <key>postinstall_script</key>
                <string>#!/bin/bash
# https://emea.psb.f-secure.com/#/c9653487/profiles/?comput?er-protection/edit/18062053/generalSettings. 
 
# In the above example, the first value ("c9653487") stands for the company profile and the second value ("18062053") for the profile ID.
# In this case, it will apply a desired profile to the first upcoming status report and after that activate the product.

ACTIVATOR="/usr/local/f-secure/bin/activator"
if [ -f "$ACTIVATOR" ]; then
/usr/local/f-secure/bin/activator --subscription-key "INSERT_KEY_HERE_IN_YOUR_OVERRIDE" --profile-id "INSERT_PROFILE_ID_HERE_IN_YOUR_OVERRIDE"
else
echo "Couldnt find $ACTIVATOR"
fi
exit</string>
                <key>uninstall_method</key>
                <string>/Applications/F-Secure/uninstall.app/Contents/Resources/UninstallStage2.app/Contents/Resources/uninstall_script</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.mikaellofgren.download.FSecureMacProtection</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>purge_destination</key>
                    <true></true>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/Applications/F-Secure</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked/com.f-secure.fsmac.gui.pkg/Payload</string>
                    <key>purge_destination</key>
                    <true></true>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/Applications/F-Secure/%NAME%.app/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleShortVersionString</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>bundleid</string>
                        <key>CFBundleName</key>
                        <string>bundlename</string>
                        <key>CFBundleVersion</key>
                        <string>bundleversion</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/F-Secure_PSB1_Mac_Installer-%version%.mpkg</string>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/F-Secure_PSB1_Mac_Installer.mpkg</string>
                </dict>
                <key>Processor</key>
                <string>PkgCopier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Applications/%NAME%.app</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/F-Secure_PSB1_Mac_Installer-%version%.mpkg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/Applications</string>
                        <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>