<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Fontagent 8.</string>
	<key>Identifier</key>
	<string>com.github.mikaellofgren.download.Fontagent8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fontagent8</string>
		        <key>DOWNLOAD_URL</key>
		<string>http://cdn.insidersoftware.com/_downloads/FontAgent8.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
             <string>URLDownloader</string>
            <key>Arguments</key>
             <dict>
                                <key>url</key>
                                <string>%DOWNLOAD_URL%</string>
                                <key>filename</key>
                <string>%NAME%.dmg</string>
                </dict>
                </dict>
<dict>
		<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg</string>
				<key>expected_authority_names</key>
        	<array>
            <string>Developer ID Installer: Insider Software Inc. (936VDEB3YQ)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
        	</array>
			</dict>
</dict>
</array>
</dict>
</plist>
