<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Fontagent 8 for and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.mikaellofgren.munki.Fontagent8</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Apps/insidersoftware/</string>
		<key>NAME</key>
		<string>FontAgent</string>
	<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
			<string>testing</string>
			</array>
			<key>category</key>
			<string>Font Management</string>
			<key>icon_name</key>
			<string>FontAgent8.png</string>
			<key>description</key>
			<string>Fontagent is one of the world’s smartest font managers.</string>
			<key>developer</key>
			<string>Insider Software</string>
			<key>display_name</key>
			<string>FontAgent 8</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>installs</key>
			<array>
			<dict>
			<key>CFBundleIdentifier</key>
			<string>com.insidersoftware.v8.fontagent</string>
			<key>CFBundleName</key>
			<string>FontAgent</string>
			<key>CFBundleShortVersionString</key>
			<string></string>
			<key>minosversion</key>
			<string>10.11</string>
			<key>path</key>
			<string>/Applications/FontAgent 8/FontAgent.app</string>
			<key>type</key>
			<string>application</string>
			<key>version_comparison_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.11</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/bash
"/Applications/FontAgent 8/Uninstaller.app/Contents/MacOS/Uninstaller"
exit 0</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.Fontagent8</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>