<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Webroot disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.mikaellofgren.munki.webroot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Webroot</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Webroot Antivirus Software</string>
            <key>display_name</key>
            <string>Webroot</string>
            <key>minimum_os_version</key>
            <string>10.7</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>postinstall_script</key>
    <string>#!/bin/sh
#insert serialkeycode
KEY=@wsa_keycode@
sudo "/Applications/Webroot SecureAnywhere.app/Contents/MacOS/Webroot SecureAnywhere" install -keycode=@wsa_keycode@ -group=@groupname@ -silent

wait 30

exit 0
    </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.webroot</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>