<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Webroot disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.mikaellofgren.munki.webroot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Webroot</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Apps</string>
        <key>pkginfo</key>
        <dict>
        <key>blocking_applications</key>
	<array/>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
             <key>category</key>
			<string>Antivirus</string>
            <key>description</key>
            <string>Webroot Antivirus Software</string>
            <key>developer</key>
			<string>Webroot</string>
            <key>display_name</key>
            <string>Webroot</string>
            <key>minimum_os_version</key>
            <string>10.7</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>postinstall_script</key>
    <string>#!/bin/sh
wsa_keycode=INSERT_KEYCODE_HERE
groupname=INSERT_GROUP_HERE

sudo "/Applications/Webroot SecureAnywhere.app/Contents/MacOS/Webroot SecureAnywhere" install -keycode="$wsa_keycode" -group="$groupname" -silent
# needs to shutdown to finish installscript
sudo /bin/bash -c 'sleep 20 &amp;&amp; killall -9 "Webroot SecureAnywhere" &amp;'
exit 0
    </string>
    <key>preinstall_script</key>
	<string>#!/bin/sh
# needs to remove old version to update with keycode
sudo killall -9 "Webroot SecureAnywhere"
sudo killall -9 WSDaemon
sudo killall -9 WfDaemon
sudo launchctl unload /Library/LaunchDaemons/com.webroot.security.mac.plist
sudo kextunload /System/Library/Extensions/SecureAnywhere.kext
sudo rm /usr/local/bin/WSDaemon
sudo rm /usr/local/bin/WFDaemon
sudo rm -rf /System/Library/Extensions/SecureAnywhere.kext
sudo rm -rf "/Applications/Webroot SecureAnywhere.app"
sudo rm /Library/LaunchAgents/com.webroot.WRMacApp.plist
sudo rm /Library/LaunchDaemons/com.webroot.security.mac.plist
sudo rm -rf /Library/Application\ Support/Webroot
exit 0</string>
    <key>preuninstall_script</key>
	<string>#!/bin/sh
sudo killall -9 "Webroot SecureAnywhere"
sudo killall -9 WSDaemon
sudo killall -9 WfDaemon
sudo launchctl unload /Library/LaunchDaemons/com.webroot.security.mac.plist
sudo kextunload /System/Library/Extensions/SecureAnywhere.kext
sudo rm /usr/local/bin/WSDaemon
sudo rm /usr/local/bin/WFDaemon
sudo rm -rf /System/Library/Extensions/SecureAnywhere.kext
sudo rm -rf "/Applications/Webroot SecureAnywhere.app"
sudo rm /Library/LaunchAgents/com.webroot.WRMacApp.plist
sudo rm /Library/LaunchDaemons/com.webroot.security.mac.plist
sudo rm -rf /Library/Application\ Support/Webroot
exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mikaellofgren.download.webroot</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>